TSD_TK/src/Enums/ТипыВыемки/ТипыВыемки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВыемки</name>
  <enumValues>
    <name>НеполнаяВыемка</name>
  </enumValues>
  <enumValues>
    <name>ВыемкуНеПроизводить</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>АдресEmailПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>0 - продажа, 1 - возврат</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАдресаМестоположения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусыОплатыЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧека</name>
    <type>
      <types>EnumRef.СтатусыЧеков</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПродажи</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаАкцизнойМарки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьШтрихкодаПриПродаже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСУчетомСкидки</name>
      <comment>Заполняется только при возврате товаров. Идентифицирует позицию чека продажи.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АкцизныеМарки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАкцизнойМарки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлатежнойСистемы</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПлатежнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСсылкиОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлипЧек</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TSD_TK/src/CommonModules/ПродажиКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

Функция РезультатПечатиЧека() Экспорт
	
	РезультатПечатиЧека = Новый Структура;
	РезультатПечатиЧека.Вставить("Успешно",          Ложь);
	РезультатПечатиЧека.Вставить("НомерЧека",          "");
	РезультатПечатиЧека.Вставить("НомерСмены",          0);
	РезультатПечатиЧека.Вставить("ПодписьЧекаЕГАИС",   "");
	РезультатПечатиЧека.Вставить("АдресЧекаЕГАИС",     "");
	РезультатПечатиЧека.Вставить("ОписаниеОшибки",     "");
	
	Возврат РезультатПечатиЧека;
	
КонецФункции

Процедура ПечатьЧекаПродажи(Параметры, РезультатПечатиЧека) Экспорт
	
	ВыходныеПараметры = Неопределено;
	
	ПараметрыЧека = Параметры.ОбщиеПараметры;
	
	ПараметрыФискализацииЧека = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	ПредзаполнитьПостоянныеПараметрыЧека(ПараметрыФискализацииЧека);
	
	ЗаполнитьЗначенияСвойств(ПараметрыФискализацииЧека, ПараметрыЧека);
	
	Если ПараметрыЧека.ТипЧека = ПродажиКлиентСерверПовтИсп.ТипЧека_Продажа() Тогда
		ПараметрыФискализацииЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");
	Иначе
		ПараметрыФискализацииЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
	КонецЕсли;
	
	ПараметрыФискализацииЧека.Вставить("ПодписьЕГАИС");
	
	Если НЕ ПараметрыЧека.ПараметрыЧекаЕГАИС = Неопределено Тогда
		
		ПараметрыФискализацииЧека.ПодписьЕГАИС = ПараметрыЧека.ПараметрыЧекаЕГАИС.ПодписьЕГАИС;
	Иначе
		
		ПараметрыФискализацииЧека.ПодписьЕГАИС = Ложь;
	КонецЕсли;
	
	Если ПараметрыФискализацииЧека.ПодписьЕГАИС Тогда
		
		ПараметрыЧекаЕГАИС = ПараметрыЧека.ПараметрыЧекаЕГАИС;
		
		ПараметрыФискализацииЧека.ОрганизацияИНН       = ПараметрыЧекаЕГАИС.ИНН;
		ПараметрыФискализацииЧека.ОрганизацияКПП       = ПараметрыЧекаЕГАИС.КПП;
		ПараметрыФискализацииЧека.НаименованиеМагазина = ПараметрыЧекаЕГАИС.НаименованиеМагазина;
		ПараметрыФискализацииЧека.СерийныйНомер        = ПараметрыЧекаЕГАИС.ЗаводскойНомерККМ;
		ПараметрыФискализацииЧека.Вставить("ПараметрыЧекаЕГАИС", ПараметрыЧекаЕГАИС);
	КонецЕсли;
	
	Если МенеджерОборудованияКлиент.ВыполнитьФискализациюЧекаНаФискальномУстройстве(Параметры.УникальныйИдентификатор,
			Параметры.ОборудованиеПечати, ПараметрыФискализацииЧека, ВыходныеПараметры) Тогда
			
		РезультатПечатиЧека.НомерЧека  = ВыходныеПараметры.НомерЧека;
		РезультатПечатиЧека.НомерСмены = ВыходныеПараметры.НомерСмены;
		РезультатПечатиЧека.Успешно = Истина;
		
		РезультатПечатиЧека.ПодписьЧекаЕГАИС = ПараметрыФискализацииЧека.ПодписьЧека;
		РезультатПечатиЧека.АдресЧекаЕГАИС   = ПараметрыФискализацииЧека.АдресЧека;
	Иначе
		РезультатПечатиЧека.ОписаниеОшибки = ВыходныеПараметры.ТекстОшибки;
		РезультатПечатиЧека.Успешно = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьВнесениеВыемку(ЭтоВнесение, Сумма, ТекстОшибки) Экспорт
	
	ОборудованиеПечати = ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПечати();
	
	ВходныеПараметры = Новый Структура("Внесение, Сумма", ЭтоВнесение, Сумма);
	ПродажиКлиент.ДобавитьПостоянныеПараметрыЧека(ВходныеПараметры);
	
	ВыходныеПараметры = Неопределено;
	
	Если Не МенеджерОборудованияКлиент.ВыполнитьВнесениеВыемку(ПодключаемоеОборудованиеКлиент.ИдентификаторКлиентаОборудования(),
			ОборудованиеПечати, ВходныеПараметры, ВыходныеПараметры) Тогда
			
		ТекстОшибки = ВыходныеПараметры.ТекстОшибки;
		Успешно = Ложь;
	Иначе
		
		Успешно = Истина;
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

Процедура ДобавитьПостоянныеПараметрыЧека(Параметры) Экспорт
	
	ПараметрыЧека = ПродажиВызовСервераПовтИсп.ПараметрыЧека();
	
	Параметры.Вставить("ОрганизацияНазвание");
	Параметры.Вставить("ОрганизацияИНН");
	Параметры.Вставить("ОрганизацияКПП");
	Параметры.Вставить("Кассир");
	Параметры.Вставить("ИмяКассира");
	Параметры.Вставить("НомерКассы");
	Параметры.Вставить("ТекстШапки");
	Параметры.Вставить("ТекстПодвала");
	Параметры.Вставить("КассирДолжность");
	Параметры.Вставить("КассирФИО");
	
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыЧека);
	
КонецПроцедуры

Процедура ПредзаполнитьПостоянныеПараметрыЧека(Параметры) Экспорт
	
	ПараметрыЧека = ПродажиВызовСервераПовтИсп.ПараметрыЧека();
	
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыЧека);
	
КонецПроцедуры

Процедура СоздатьЧек(МассивНоменклатуры, ДополнительныеПараметры, Сканирование = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СозданиеПослеСканирования", Сканирование);
	ПараметрыФормы.Вставить("МассивНоменклатуры", МассивНоменклатуры);
	
	ФормаЧека = ПолучитьФорму("Документ.Чек.Форма.ФормаДокумента", ПараметрыФормы, ДополнительныеПараметры.Форма);
	ФормаЧека.Открыть();
	
	ДополнительныеПараметры.Форма = ФормаЧека;
	
КонецПроцедуры

Процедура ПолучитьНоменклатуруПоШтрихкоду(Штрихкод, ДополнительныеПараметры, ВводитьАкцизныеМарки = Ложь) Экспорт
	
	МассивНоменклатуры = ОбработкаТабличнойЧастиВызовСервера.НайтиПоШтрихкоду(Штрихкод);
	
	ДополнительныеПараметры.Вставить("Штрихкод", Штрихкод);
	ДополнительныеПараметры.Вставить("ВводитьАкцизныеМарки", ВводитьАкцизныеМарки);
	
	Если МассивНоменклатуры.Количество() = 0 Тогда
		
		ДополнительныеПараметры.Вставить("ВременноеЗакрытиеДиалога", Истина);
		ЗакрытьСканированиеШтрихКодов(ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		
		КнопкаПоУмолчанию = "Закрыть";
		
		Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов() Тогда
			Кнопки.Добавить("ПродолжитьСканирование", НСтр("ru = 'Продолжить сканирование'"));
			КнопкаПоУмолчанию = "ПродолжитьСканирование";
		КонецЕсли;
		
		Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() Тогда
			Кнопки.Добавить("ДобавитьВПрайсЛист", НСтр("ru = 'Добавить в прайс-лист'"));
			КнопкаПоУмолчанию = "ДобавитьВПрайсЛист";
		КонецЕсли;
		
		Кнопки.Добавить("Закрыть", НСтр("ru = 'Закрыть'"));
		
		Оповещение = Новый ОписаниеОповещения("ВопросТоварНеНайден", ПродажиКлиент, ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Товар не найден'"), Кнопки,, КнопкаПоУмолчанию, Штрихкод);
		
	ИначеЕсли МассивНоменклатуры.Количество() = 1 Тогда
		
		ДанныеНоменклатуры = МассивНоменклатуры[0];
		ДополнительныеПараметры.Вставить("ДанныеНоменклатуры", ДанныеНоменклатуры);
		
		//Если ВводитьАкцизныеМарки И ДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки Тогда
		//	
		//	ВвестиАкцизнуюМарку(ДанныеНоменклатуры, ДополнительныеПараметры);
		//Иначе
		//	
			ДополнительныеПараметры.Форма.ОбработатьПолученнуюПоШтрихкодуНоменклатуру(МассивНоменклатуры[0],
				ДополнительныеПараметры);
		//КонецЕсли;
		
	Иначе
		
		ДополнительныеПараметры.Вставить("ВременноеЗакрытиеДиалога", Истина);
		ЗакрытьСканированиеШтрихКодов(ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура;
		СписокНоменклатуры = Новый СписокЗначений;
		СписокНоменклатуры.ЗагрузитьЗначения(МассивНоменклатуры);
		
		МассивДляОтбора = Новый Массив;
		
		Для Каждого ДанныеНоменклатуры Из МассивНоменклатуры Цикл
			МассивДляОтбора.Добавить(ДанныеНоменклатуры.Номенклатура);
		КонецЦикла;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", МассивДляОтбора);
		
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПослеВыбораНоменклатуры", ПродажиКлиент,
			ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораПриСовпадении", ПараметрыФормы, 
			ДополнительныеПараметры.Форма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПометитьКВыгрузкеОтчетОПродажах(СсылкаНаОтчет) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОтчет) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещатьОбИзменении = Ложь;
	
	ПродажиВызовСервера.ПометитьКВыгрузкеОтчетОПродажах(СсылкаНаОтчет, ОповещатьОбИзменении);
	
	Если ОповещатьОбИзменении Тогда
		Оповестить("ИзмененОтчетОПродажах");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьПодборТоваров(Форма, ОписаниеОповещения) Экспорт
	
	Если ПродажиВызовСервера.ПроверитьВозможностьВводаЧека() Тогда
		
		Если ЗначениеНастроекВызовСервераПовтИсп.ПрайсЛистПуст() Тогда
			
			Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() Тогда
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Форма", Форма);
				ДополнительныеПараметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПодборТоваровСоздатьТовар", ЭтотОбъект, ДополнительныеПараметры);
				
				ТекстВопроса = НСтр("ru = 'Создать новую товарную позицию?'");
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,НСтр("ru = 'Прайс-лист пуст'"));
				
			Иначе
				
				ТекстПредупреждения = НСтр("ru = 'Необходимо выполнить синхронизацию (Сервис - Загрузить данные)'");
				ПоказатьПредупреждение(, ТекстПредупреждения,,
					НСтр("ru = 'Прайс-лист пуст'"));
				
			КонецЕсли;
		Иначе
			
			ОткрытьФормуПодбораТоваров(Форма, ОписаниеОповещения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Касса 

Процедура ОткрытьСмену(Форма, ОписаниеОповещение = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	Если ОписаниеОповещение = Неопределено Тогда
		ОписаниеПриЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыОткрытиеСмены", ЭтотОбъект);
	Иначе
		ОписаниеПриЗакрытии = ОписаниеОповещение;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.КассовыеОперации.Форма.ОткрытиеСмены", ПараметрыФормы, Форма,,,, ОписаниеПриЗакрытии);
	
КонецПроцедуры

Процедура ПослеЗакрытияФормыОткрытиеСмены(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ЗакрытьСмену(Форма) Экспорт
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытьСменуПродолжение", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = НСтр("ru = 'Закрыть кассовую смену?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, " ");
	
КонецПроцедуры

Процедура ПослеЗакрытияФормыЗакрытияСмены(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ОтчетБезГашения(Форма) Экспорт
	
	
	ПараметрыФормы = Новый Структура;
	ОписаниеПриЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыОтчетБезГашения", ЭтотОбъект);
	ОткрытьФорму("Обработка.КассовыеОперации.Форма.ОтчетБезГашения", ПараметрыФормы, Форма,,,, ОписаниеПриЗакрытии);
	
КонецПроцедуры

// Заказы клиентов

Процедура СоздатьЗаказКлиента(МассивНоменклатуры, ДополнительныеПараметры, Сканирование = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СозданиеПослеСканирования", Сканирование);
	ПараметрыФормы.Вставить("МассивНоменклатуры", МассивНоменклатуры);
	
	ФормаДокумента = ПолучитьФорму("Документ.ЗаказКлиента.Форма.ФормаДокумента", ПараметрыФормы, ДополнительныеПараметры.Форма);
	ФормаДокумента.Открыть();
	
	ДополнительныеПараметры.Форма = ФормаДокумента;
	
КонецПроцедуры

// Платежная система

// оплата
Функция ПараметрыОплатыПоПлатежнойСистеме() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Сумма"              , 0);
	Параметры.Вставить("НомерЧека"          , "");
	Параметры.Вставить("НомерКарты"         , "");
	Параметры.Вставить("НомерСсылкиОперации", "");
	Параметры.Вставить("КодАвторизации"     , "");
	Параметры.Вставить("УникальныйИдентификатор");
	Параметры.Вставить("Оборудование");
	
	Возврат Параметры;
КонецФункции

Функция РезультатОплатыПоПлатежнойСистеме() Экспорт
	
	РезультатОплаты = Новый Структура;
	
	РезультатОплаты.Вставить("ВидОперации"        , ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнойСистемы.Оплата"));
	РезультатОплаты.Вставить("Успешно"            , Ложь);
	РезультатОплаты.Вставить("ТекстОшибки"        , "");
	РезультатОплаты.Вставить("НомерКарты"         , "");
	РезультатОплаты.Вставить("НомерСсылкиОперации", "");
	РезультатОплаты.Вставить("КодАвторизации"     , "");
	РезультатОплаты.Вставить("СлипЧек", "");
	РезультатОплаты.Вставить("ДатаОперации");
	
	Возврат РезультатОплаты;
	
КонецФункции

Функция ОплатитьПоПлатежнойСистеме(ПараметрыОплаты) Экспорт
	
	ВыходныеПараметры = Неопределено;
	ВходныеПараметры = Новый Структура();
	ВходныеПараметры.Вставить("Сумма"               , ПараметрыОплаты.Сумма);
	ВходныеПараметры.Вставить("НомерЧека"           , ПараметрыОплаты.НомерЧека);
	ВходныеПараметры.Вставить("НомерКарты"          , ПараметрыОплаты.НомерКарты);
	ВходныеПараметры.Вставить("НомерСсылкиОперации" , ПараметрыОплаты.НомерСсылкиОперации);
	ВходныеПараметры.Вставить("КодАвторизации"      , ПараметрыОплаты.КодАвторизации);
	
	РезультатОплаты = РезультатОплатыПоПлатежнойСистеме();
	
	Если МенеджерОборудованияКлиент.ВыполнитьОплатуПоПлатежнойСистеме(
			ПараметрыОплаты.УникальныйИдентификатор,
			ПараметрыОплаты.Оборудование,
			ВходныеПараметры,
			ВыходныеПараметры) Тогда
			
		РезультатОплаты.Успешно = Истина;
		
		РезультатОплаты.НомерКарты          = ?(ВыходныеПараметры.НомерКарты = Неопределено, "", ВыходныеПараметры.НомерКарты);
		РезультатОплаты.НомерСсылкиОперации = ?(ВыходныеПараметры.НомерСсылкиОперации = Неопределено, "", ВыходныеПараметры.НомерСсылкиОперации);
		РезультатОплаты.КодАвторизации      = ?(ВыходныеПараметры.КодАвторизации = Неопределено, "", ВыходныеПараметры.КодАвторизации);
		РезультатОплаты.СлипЧек             = ?(ВыходныеПараметры.СлипЧек = Неопределено, "", ВыходныеПараметры.СлипЧек);
		РезультатОплаты.ДатаОперации        = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату();
	Иначе
		
		РезультатОплаты.Успешно = Ложь;
		РезультатОплаты.ТекстОшибки = ВыходныеПараметры.ТекстОшибки;
	КонецЕсли;
	
	Возврат РезультатОплаты;
	
КонецФункции

// отмена оплаты

Функция ПараметрыОтменыОплатыПоПлатежнойСистеме() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Сумма"              , 0);
	Параметры.Вставить("НомерЧека"          , "");
	Параметры.Вставить("НомерКарты"         , "");
	Параметры.Вставить("НомерСсылкиОперации", "");
	Параметры.Вставить("КодАвторизации"     , "");
	Параметры.Вставить("УникальныйИдентификатор");
	Параметры.Вставить("Оборудование");
	
	Возврат Параметры;
	
КонецФункции

Функция РезультатОтменыОплатыПоПлатежнойСистеме() Экспорт
	
	РезультатОплаты = Новый Структура;
	
	РезультатОплаты.Вставить("ВидОперации"        , ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнойСистемы.ОтменаОплаты"));
	РезультатОплаты.Вставить("Успешно"            , Ложь);
	РезультатОплаты.Вставить("ТекстОшибки"        , "");
	РезультатОплаты.Вставить("НомерКарты"         , "");
	РезультатОплаты.Вставить("НомерСсылкиОперации", "");
	РезультатОплаты.Вставить("КодАвторизации"     , "");
	РезультатОплаты.Вставить("СлипЧек", "");
	РезультатОплаты.Вставить("ДатаОперации");
	
	Возврат РезультатОплаты;
	
КонецФункции

Функция ОтменитьОплатуПоПлатежнойСистеме(ПараметрыОтменыОплаты) Экспорт
	
	ВыходныеПараметры = Неопределено;
	ВходныеПараметры = Новый Структура();
	ВходныеПараметры.Вставить("Сумма"              , ПараметрыОтменыОплаты.Сумма);
	ВходныеПараметры.Вставить("НомерЧека"          , ПараметрыОтменыОплаты.НомерЧека);
	ВходныеПараметры.Вставить("НомерКарты"         , ПараметрыОтменыОплаты.НомерКарты);
	ВходныеПараметры.Вставить("НомерСсылкиОперации", ПараметрыОтменыОплаты.НомерСсылкиОперации);
	ВходныеПараметры.Вставить("КодАвторизации"     , ПараметрыОтменыОплаты.КодАвторизации);
	
	РезультатОтменыОплаты = РезультатОтменыОплатыПоПлатежнойСистеме();
	
	Если МенеджерОборудованияКлиент.ВыполнитьОтменуПлатежаПоПлатежнойСистеме(
			ПараметрыОтменыОплаты.УникальныйИдентификатор,
			ПараметрыОтменыОплаты.Оборудование,
			ВходныеПараметры,
			ВыходныеПараметры) Тогда
			
		РезультатОтменыОплаты.Успешно = Истина;
		
		РезультатОтменыОплаты.НомерКарты          = ?(ВыходныеПараметры.НомерКарты = Неопределено, "", ВыходныеПараметры.НомерКарты);
		РезультатОтменыОплаты.НомерСсылкиОперации = ВходныеПараметры.НомерСсылкиОперации;
		РезультатОтменыОплаты.КодАвторизации      = ВходныеПараметры.КодАвторизации;
		РезультатОтменыОплаты.СлипЧек             = ?(ВыходныеПараметры.СлипЧек = Неопределено, "", ВыходныеПараметры.СлипЧек);
		РезультатОтменыОплаты.ДатаОперации        = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату();
	Иначе
		
		РезультатОтменыОплаты.Успешно = Ложь;
		РезультатОтменыОплаты.ТекстОшибки = ВыходныеПараметры.ТекстОшибки;
	КонецЕсли;
	
	Возврат РезультатОтменыОплаты;
	
КонецФункции

// возврат оплаты

Функция ПараметрыВозвратаОплатыПоПлатежнойСистеме() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Сумма"              , 0);
	Параметры.Вставить("НомерЧека"          , "");
	Параметры.Вставить("НомерКарты"         , "");
	Параметры.Вставить("НомерСсылкиОперации", "");
	Параметры.Вставить("КодАвторизации"     , "");
	Параметры.Вставить("УникальныйИдентификатор");
	Параметры.Вставить("Оборудование");
	
	Возврат Параметры;
КонецФункции

Функция РезультатВозвратаОплатыПоПлатежнойСистеме() Экспорт
	
	РезультатОплаты = Новый Структура;
	
	РезультатОплаты.Вставить("ВидОперации"        , ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнойСистемы.ВозвратОплаты"));
	РезультатОплаты.Вставить("Успешно"            , Ложь);
	РезультатОплаты.Вставить("ТекстОшибки"        , "");
	РезультатОплаты.Вставить("НомерКарты"         , "");
	РезультатОплаты.Вставить("НомерСсылкиОперации", "");
	РезультатОплаты.Вставить("КодАвторизации"     , "");
	РезультатОплаты.Вставить("СлипЧек"            , "");
	РезультатОплаты.Вставить("ДатаОперации");
	
	Возврат РезультатОплаты;
	
КонецФункции

Функция ВозвратитьОплатуПоПлатежнойСистеме(ПараметрыВозвратаОплаты) Экспорт
	
	ВыходныеПараметры = Неопределено;
	ВходныеПараметры = Новый Структура();
	ВходныеПараметры.Вставить("Сумма"              , ПараметрыВозвратаОплаты.Сумма);
	ВходныеПараметры.Вставить("НомерЧека"          , ПараметрыВозвратаОплаты.НомерЧека);
	ВходныеПараметры.Вставить("НомерКарты"         , ПараметрыВозвратаОплаты.НомерКарты);
	ВходныеПараметры.Вставить("НомерСсылкиОперации", ПараметрыВозвратаОплаты.НомерСсылкиОперации);
	ВходныеПараметры.Вставить("КодАвторизации"     , ПараметрыВозвратаОплаты.КодАвторизации);
	
	РезультатВозвратаОплаты = РезультатВозвратаОплатыПоПлатежнойСистеме();
	
	Если МенеджерОборудованияКлиент.ВыполнитьВозвратПлатежаПоПлатежнойСистеме(
			ПараметрыВозвратаОплаты.УникальныйИдентификатор,
			ПараметрыВозвратаОплаты.Оборудование,
			ВходныеПараметры,
			ВыходныеПараметры) Тогда
			
		РезультатВозвратаОплаты.Успешно = Истина;
		
		РезультатВозвратаОплаты.НомерКарты          = ?(ВыходныеПараметры.НомерКарты = Неопределено, "", ВыходныеПараметры.НомерКарты);
		РезультатВозвратаОплаты.НомерСсылкиОперации = ?(ВыходныеПараметры.НомерСсылкиОперации = Неопределено, "", ВыходныеПараметры.НомерСсылкиОперации);
		РезультатВозвратаОплаты.КодАвторизации      = ?(ВыходныеПараметры.КодАвторизации = Неопределено, "", ВыходныеПараметры.КодАвторизации);
		РезультатВозвратаОплаты.СлипЧек             = ?(ВыходныеПараметры.СлипЧек = Неопределено, "", ВыходныеПараметры.СлипЧек);
		РезультатВозвратаОплаты.ДатаОперации        = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату();
	Иначе
		
		РезультатВозвратаОплаты.Успешно = Ложь;
		РезультатВозвратаОплаты.ТекстОшибки = ВыходныеПараметры.ТекстОшибки;
	КонецЕсли;
	
	Возврат РезультатВозвратаОплаты;
	
КонецФункции


// сверка итогов

Функция ПараметрыСверкиПоПлатежнойСистеме() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("УникальныйИдентификатор");
	Параметры.Вставить("Оборудование");
	Параметры.Вставить("ИмяПроцедурыОповещения");
	
	Возврат Параметры;
	
КонецФункции

Функция РезультатСверкиПоПлатежнойСистеме()
	
	РезультатСверки = Новый Структура;
	
	РезультатСверки.Вставить("Успешно", Ложь);
	РезультатСверки.Вставить("СлипЧек",   "");
	РезультатСверки.Вставить("ТекстОшибки",   "");
	
	Возврат РезультатСверки;
	
КонецФункции

Функция СверитьИтогиПоПлатежнойСистеме(ПараметрыСверки) Экспорт
	
	РезультатСверки = РезультатСверкиПоПлатежнойСистеме();
	
	ВыходныеПараметры = Неопределено;
	
	Если МенеджерОборудованияКлиент.ВыполнитьСверкуИтоговПоПлатежнойСистеме(
		ПараметрыСверки.УникальныйИдентификатор,
		ПараметрыСверки.Оборудование,
		ВыходныеПараметры) Тогда
		
		РезультатСверки.Успешно = Истина;
		РезультатСверки.СлипЧек = ВыходныеПараметры.СлипЧек;
	Иначе
		
		РезультатСверки.Успешно = Ложь;
		РезультатСверки.ТекстОшибки = ВыходныеПараметры.ТекстОшибки;
	КонецЕсли;
	
	Возврат РезультатСверки;
	
КонецФункции

Процедура СверитьИОтобразитьИтогиПоПлатежнойСистеме(Форма) Экспорт
	
	ПараметрыСверки = ПродажиКлиент.ПараметрыСверкиПоПлатежнойСистеме();
	ПараметрыСверки.УникальныйИдентификатор = Форма.УникальныйИдентификатор;
	ПараметрыСверки.Оборудование = ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПлатежнойСистемы();
	
	РезультатСверки = ПродажиКлиент.СверитьИтогиПоПлатежнойСистеме(ПараметрыСверки);
	
	Если РезультатСверки.Успешно Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекстСлипЧека", РезультатСверки.СлипЧек);
		ПараметрыФормы.Вставить("ДатаОперации", ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату());
		
		ОткрытьФорму("ОбщаяФорма.СлипЧекПлатежнойСистемы", ПараметрыФормы, Форма);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатСверки.ТекстОшибки);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура ВвестиАкцизнуюМарку(ДанныеНоменклатуры, ДополнительныеПараметры)
//	
//	ПараметрыВводаМарки = ИнтеграцияЕГАИСМККлиент.ПараметрыВводаАкцизнойМарки();
//	
//	ПараметрыВводаМарки.Номенклатура             = ДанныеНоменклатуры.Номенклатура;
//	ПараметрыВводаМарки.ОбъектОповещения         = ЭтотОбъект;
//	ПараметрыВводаМарки.ИмяПроцедурыОповещения   = "ВводАкцизныхМарокЗавершение";
//	ПараметрыВводаМарки.АдресМарокЧекаВХранилище = ДополнительныеПараметры.Форма.АдресМарокЧекаВХранилище();
//	
//	Если ДополнительныеПараметры.Свойство("ВозвратТоваров") Тогда
//		ДанныеТовараКВозврату = ПродажиВызовСервера.ПолучитьДанныеПоТоваруКВозврату(
//		ДополнительныеПараметры.ЧекПродажи, Неопределено, ДанныеНоменклатуры.Номенклатура, Неопределено);
//		
//		ПараметрыВводаМарки.МаксимальноеКоличество = ДанныеТовараКВозврату.МаксимальноеКоличествоКВозврату;
//		
//	КонецЕсли;
//	
//	Если ДополнительныеПараметры.Свойство("КонтрольДублейМарок") Тогда
//		ПараметрыВводаМарки.КонтрольДублейМарок = ДополнительныеПараметры.КонтрольДублейМарок;
//	КонецЕсли;
//	
//	ДополнительныеПараметры.Вставить("ВременноеЗакрытиеДиалога", Истина);
//	ЗакрытьСканированиеШтрихКодов(ДополнительныеПараметры);
//	
//	ИнтеграцияЕГАИСМККлиент.ВвестиАкцизнуюМарку(ПараметрыВводаМарки, ДополнительныеПараметры);
//	
//КонецПроцедуры

Процедура ОповещениеПодборТоваровСоздатьТовар(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеСоздатьТовар", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",, ДополнительныеПараметры.Форма,,,, Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеСоздатьТовар(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ОткрытьФормуПодбораТоваров(ДополнительныеПараметры.Форма, ДополнительныеПараметры.ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуПодбораТоваров(Форма, ОписаниеОповещения)
	
	ОткрытьФорму("Обработка.ПодборТоваров.Форма.ФормаПодбора",, Форма,,,,ОписаниеОповещения);
	
КонецПроцедуры

Процедура ВопросТоварНеНайден(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "ПродолжитьСканирование" Тогда
		
		ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
		ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
		
	ИначеЕсли Результат = "ДобавитьВПрайсЛист" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДобавлениеШтрихкодаВПрайсЛист");
		ПараметрыФормы.Вставить("Штрихкод", ДополнительныеПараметры.Штрихкод);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеДобавитьВПрайсЛист", ПродажиКлиент, ДополнительныеПараметры);
		
		ОткрытьФорму("Обработка.ПанельМеню.Форма.ПрайсЛист", ПараметрыФормы, ДополнительныеПараметры.Форма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеДобавитьВПрайсЛист(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНоменклатуры = ОбработкаТабличнойЧастиТоварыКлиентСервер.ПередаваемыеДанныеНоменклатуры();
	
	ДанныеНоменклатуры.Номенклатура                    = Результат;
	ДанныеНоменклатуры.Штрихкод                        = ДополнительныеПараметры.Штрихкод;
	ДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки = ПродажиВызовСервера.ОпределитьНеобходимостьВводаАкцизнойМарки(Результат);
	
	ДополнительныеПараметры.Вставить("ДанныеНоменклатуры", ДанныеНоменклатуры);
	
	//Если ДополнительныеПараметры.ВводитьАкцизныеМарки И ДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки Тогда
	//	
	//	ВвестиАкцизнуюМарку(ДанныеНоменклатуры, ДополнительныеПараметры);
	//	
	//Иначе
		
		ДополнительныеПараметры.Форма.ОбработатьПолученнуюПоШтрихкодуНоменклатуру(ДанныеНоменклатуры, ДополнительныеПараметры);
		
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗакрытьСменуПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет ИЛИ Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроизвестиВыемкуПередЗакрытиемСмены(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПроизвестиВыемкуПередЗакрытиемСмены(ДополнительныеПараметры)
	
	ОстатокНаличныхВКассе = ПродажиВызовСервера.ПолучитьОстатокНаличныхВКассе();
	
	Если ОстатокНаличныхВКассе > 0 Тогда
		
		ТипВыемки = ПродажиВызовСервераПовтИсп.ТипВыемкиПриЗакрытииСмены();
		
		Если НЕ ЗначениеЗаполнено(ТипВыемки) Тогда // полная выемка
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ВидДвижения", "Изъятие");
			ПараметрыФормы.Вставить("ТипВыемки",   ТипВыемки);
			ПараметрыФормы.Вставить("ОстатокНаличныхВКассе", ОстатокНаличныхВКассе);
			
			ОповещениеПослеВыемки = Новый ОписаниеОповещения("ЗакрытьСменуПослеВыемкиНаличных", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("Документ.ВнесениеИзъятиеНаличных.Форма.ФормаДокумента", ПараметрыФормы, ДополнительныеПараметры.Форма,,,,ОповещениеПослеВыемки);
			
		ИначеЕсли ТипВыемки = ПредопределенноеЗначение("Перечисление.ТипыВыемки.НеполнаяВыемка") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ВидДвижения",           "Изъятие");
			ПараметрыФормы.Вставить("ТипВыемки",             ТипВыемки);
			ПараметрыФормы.Вставить("ОстатокНаличныхВКассе", ОстатокНаличныхВКассе);
			
			ОповещениеПослеВыемки = Новый ОписаниеОповещения("ЗакрытьСменуПослеВыемкиНаличных", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("Документ.ВнесениеИзъятиеНаличных.Форма.ФормаДокумента", ПараметрыФормы, ДополнительныеПараметры.Форма,,,,ОповещениеПослеВыемки);
			
		ИначеЕсли ТипВыемки = ПредопределенноеЗначение("Перечисление.ТипыВыемки.ВыемкуНеПроизводить") Тогда
			
			ЗакрытьСменуПослеВыемкиНаличных(Новый Структура("Успешно", Истина), ДополнительныеПараметры);
		КонецЕсли;
		
	Иначе //нет наличных к выемке
		
		ЗакрытьСменуПослеВыемкиНаличных(Новый Структура("Успешно", Истина), ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗакрытьСменуПослеВыемкиНаличных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("Успешно") И НЕ Результат.Успешно Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ОборудованиеПечати = ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПечати();
	
	ЕстьОшибки = Ложь;
	Если ЗначениеЗаполнено(ОборудованиеПечати) Тогда
		
		ПараметрыФормы = Новый Структура;
		ОписаниеПриЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗакрытияСмены", ЭтотОбъект);
		ОткрытьФорму("Обработка.КассовыеОперации.Форма.ЗакрытиеСмены", ПараметрыФормы, Форма,,,, ОписаниеПриЗакрытии);
		
	Иначе
		
		Если НЕ ЕстьОшибки Тогда
			ПродажиВызовСервера.ЗакрытьДокументКассоваяСмена();
			Оповестить("ИзмененаКассоваяСмена");
			Оповестить("ИзмененОтчетОПродажах");
		КонецЕсли;
		
		Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПлатежнаяСистема() Тогда
			ПродажиКлиент.СверитьИОтобразитьИтогиПоПлатежнойСистеме(Форма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗакрытияФормыОтчетБезГашения(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ОповещениеПослеВыбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНоменклатуры = ОбработкаТабличнойЧастиТоварыКлиентСервер.ПередаваемыеДанныеНоменклатуры();
	ДанныеНоменклатуры.Номенклатура                    = Результат;
	ДанныеНоменклатуры.Штрихкод                        = ДополнительныеПараметры.Штрихкод;
	ДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки = ПродажиВызовСервера.ОпределитьНеобходимостьВводаАкцизнойМарки(Результат);
	
	ДополнительныеПараметры.Вставить("ДанныеНоменклатуры", ДанныеНоменклатуры);
	
	//Если ДополнительныеПараметры.ВводитьАкцизныеМарки И ДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки Тогда
	//	
	//	ВвестиАкцизнуюМарку(ДанныеНоменклатуры, ДополнительныеПараметры);
	//	
	//Иначе
	//	
		ДополнительныеПараметры.Форма.ОбработатьПолученнуюПоШтрихкодуНоменклатуру(ДанныеНоменклатуры, ДополнительныеПараметры);
		
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗакрытьСканированиеШтрихКодов(ДополнительныеПараметры)
	
	Если ЗначениеНастроекВызовСервераПовтИсп.СканированиеВстроеннойКамерой() Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВводАкцизныхМарокЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Свойство("АдресВХранилище") Тогда
			ДополнительныеПараметры.ДанныеНоменклатуры.АкцизныеМарки = Результат.АдресВХранилище;
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.ОбработатьПолученнуюПоШтрихкодуНоменклатуру(ДополнительныеПараметры.ДанныеНоменклатуры, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти
